In [22]:
import argparse
import os.path
import time
import pandas as pd
import datetime
import configparser 
now = datetime.datetime.now()
print (now.strftime("%Y-%m-%d %H:%M"))

2018-12-30 19:01

# Load Input CSV file

In [23]:
config = configparser.ConfigParser()
config.sections()
config.read('config.ini')
input_file=config['DEFAULT']['input_file']
print ('Input file:', input_file)

Input file: sample-imput/activities.csv

In [24]:
df_input_file=pd.read_csv(input_file, header=None, delimiter='|')

In [25]:
df_input_file.describe()

,0,1,2,3,4,5
count,1000,1000,1000,1000,1000,1000
unique,407,2,703,3,691,1000
top,0000-0001-5738-1893,educations,Universidad Central,RINGGOLD,27979,0000-0001-5123-8893_employments_4445793
freq,9,608,7,907,7,1

In [28]:
df_input_file.head()

,0,1,2,3,4,5
0,0000-0002-1484-1893,employments,Instituto Politécnico do Porto Escola Superior...,RINGGOLD,203255,0000-0002-1484-1893_employments_5636083
1,0000-0002-1484-1893,educations,Universidade do Porto Faculdade de Desporto,RINGGOLD,224740,0000-0002-1484-1893_educations_5636056
2,0000-0002-1484-1893,educations,Universidade do Porto Faculdade de Desporto,RINGGOLD,224740,0000-0002-1484-1893_educations_5636066
3,0000-0002-1484-1893,educations,Instituto Politécnico do Porto Escola Superior...,RINGGOLD,203255,0000-0002-1484-1893_educations_5636079
4,0000-0001-5057-7893,employments,University of Oregon College of Education,RINGGOLD,143853,0000-0001-5057-7893_employments_64516

In [35]:
# Number of org IDs per source
df=df_input_file.groupby(3)[0].count()
df

3
FUNDREF      32
GRID         61
RINGGOLD    907
Name: 0, dtype: int64

In [40]:
# Number of unique org IDs per source
df_input_file.groupby(3)[4].nunique()

3
FUNDREF      23
GRID         45
RINGGOLD    623
Name: 4, dtype: int64

# Create nodes_orcid_organisation.csv